# Introduction to Pandas

The following code will import the required Python libraries

In [4]:
import pandas as pd

## Import Excel data

Retrieve Excel sheet and place in a data frame

In [6]:
college = pd.read_excel("OCMAdemo-excel.xlsx", sheet_name="Sheet1")
print(college)

       College      Location  Population
0        Seneca  North York        45000
1  George Brown      Toronto       30000
2        Humber      Rexdale       40000

## Output into JSON format

In [12]:
college.to_json()

'{"College ":{"0":"Seneca","1":"George Brown","2":"Humber"},"Location":{"0":"North York ","1":"Toronto","2":"Rexdale"},"Population":{"0":45000,"1":30000,"2":40000}}'

## Other Functionality

In [10]:
titanic = pd.read_csv('titanic.csv')

Given the number of rows / columns, using the `shape` method

In [12]:
print(titanic.shape)

(891, 15)

Look at the first few rows of the data set using the `head` method.

In [29]:
titanic.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

Find the column names

In [8]:
print(titanic.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')



Find the types of data in each columns

In [14]:
print(titanic.dtypes)

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

Find median for all numeric variables

In [19]:
print(titanic.median(numeric_only=True))

survived       0.0000
pclass         3.0000
age           28.0000
sibsp          0.0000
parch          0.0000
fare          14.4542
adult_male     1.0000
alone          1.0000
dtype: float64

Find titanic passengers who paid less than 10 pounds for ill-fated ship

In [26]:
titanic[titanic.fare < 10.0]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
877,0,3,male,19.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Chaining multiple commands - (Function Composition)


Here the sex, and survived columns are returned from all rows....then the `head` method is called to print the first few rows of the result.

In [34]:
titanic[["sex","survived"]].head()

      sex  survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0